# Ultralytics YOLO, AGPL-3.0 license
# ML-DETR ECIE-only ablation model.

nc: 10  # number of classes for VisDrone
scales:
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

head_channel: 256

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, ECIE, [128]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, ECIE, [256]] # 4-P3/8
  - [-1, 1, Conv, [384, 3, 2]] # 5-P4/16
  - [-1, 1, ECIE, [384]] # 6-P4/16
  - [-1, 1, Conv, [384, 3, 2]] # 7-P5/32
  - [-1, 3, ECIE, [384]] # 8-P5/32

head:
  - [-1, 1, Conv, [head_channel, 1, 1, None, 1, 1, False]] # 9 input_proj.2 from ECIE P5
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, Conv, [head_channel, 1, 1]] # 11, Y5

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [6, 1, Conv, [head_channel, 1, 1, None, 1, 1, False]] # 13 input_proj.1 from ECIE P4
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 3, RepC3, [head_channel, 0.5]] # 15, fpn_blocks.0
  - [-1, 1, Conv, [head_channel, 1, 1]] # 16, Y4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [4, 1, Conv, [head_channel, 1, 1, None, 1, 1, False]] # 18 input_proj.0 from ECIE P3
  - [[-2, -1], 1, Concat, [1]] # 19
  - [-1, 3, RepC3, [head_channel, 0.5]] # X3 (20)

  - [-1, 1, Conv, [head_channel, 3, 2]] # 21, downsample_convs.0
  - [[-1, 16], 1, Concat, [1]] # 22 cat Y4
  - [-1, 3, RepC3, [head_channel, 0.5]] # F4 (23)

  - [-1, 1, Conv, [head_channel, 3, 2]] # 24, downsample_convs.1
  - [[-1, 11], 1, Concat, [1]] # 25 cat Y5
  - [-1, 3, RepC3, [head_channel, 0.5]] # F5 (26)

  - [[20, 23, 26], 1, RTDETRDecoder, [nc, head_channel, 300, 4, 8, 3]] # Detect(P3, P4, P5)
