
nc: 10  # number of classes for VisDrone
scales: # model compound scaling constants

  l: [1.00, 1.00, 1024]

head_channel: 256
toglsr_inner: 128

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, ECIE, [128]]  # 2, ECIE encoder block
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, ECIE, [256]] # 4, ECIE encoder block
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, ECIE, [384]] # 6, ECIE encoder block
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, ECIE, [384]] # 8, ECIE encoder block

head:
  - [-1, 1, Conv, [head_channel, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 10
  - [-1, 1, TOGLSR, [head_channel, toglsr_inner]]  # 11, Y5, topology-guided lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [6, 1, TOGLSR, [head_channel, toglsr_inner]]  # 13, Y4, topology-guided input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 3, RepC3, [head_channel, 0.5]]  # 15, fpn_blocks.0
  - [-1, 1, Conv, [head_channel, 1, 1]]   # 16, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [4, 1, TOGLSR, [head_channel, toglsr_inner]]  # 18, Y3, topology-guided input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 19 cat backbone P3
  - [-1, 3, RepC3, [head_channel, 0.5]]  # X3 (20), fpn_blocks

  - [-1, 1, Conv, [head_channel, 3, 2]]   # 21, downsample_convs.0
  - [[-1, 16], 1, Concat, [1]]  # 22 cat Y4
  - [-1, 3, RepC3, [head_channel, 0.5]]  # F4 (23), pan_blocks.0

  - [-1, 1, Conv, [head_channel, 3, 2]]   # 24, downsample_convs.1
  - [[-1, 11], 1, Concat, [1]]  # 25 cat Y5
  - [-1, 3, RepC3, [head_channel, 0.5]]  # F5 (26), pan_blocks.1

  - [[20, 23, 26], 1, SSMamba, [256, 16, 4, 2, 4, 96, 0.02]]  # 27, [c2, d_state, d_conv, expand, reduction, state_c, res_init]
  - [-1, 1, RTDETRDecoder, [nc, head_channel, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
